export const BookData = [
  {
    title: "코딩 개념 잡는 자바 코딩 문제집 (문제를 최대한 많이 풀어라!)",
    link: "https://search.shopping.naver.com/book/catalog/34737471638",
    image:
      "https://shopping-phinf.pstatic.net/main_3473747/34737471638.20220926113307.jpg",
    author: "안겔 레오나르드",
    discount: 43200,
    publisher: "길벗",
    isbn: 9791140701452,
    description:
      "모던 자바를 빠르게 공략한다\n \n모던 자바의 주요 개념을 확실하게 이해한다\n현대 프로그래밍 언어의 트렌드를 반영하면서 자바에는 타입 추론, 함수형, 옵셔널, 널 안전 스트림, 디폴트 메서드, 중첩 기반 접근 제어, 퓨처, 개선된 동시성 기능 등이 추가되었다. 300개 이상의 응용프로그램과 1,000개 이상의 예제를 통해 주요 개념을 확실하게 이해하자.\n \n빠르게 발전한 자바 문법과 라이브러리를 익힌다\n자바 언어가 빠르게 발전하면서 자바 문법과 라이브러리에 많은 변화가 생겼다. 이러한 변화는 개발 환경의 변화와 그에 따른 개발자들의 요구를 수용하기 위한 것이었지만, 학습 곡선을 빠르게 높였다. 즉, 학습하기 어려워졌다. 이러한 변화는 자바 입문서로는 제대로 배우기 어렵다. 문법 이후 막막한 학생, 빠르게 발전한 자바의 발전을 따라 잡고 싶은 개발자에게 필요한 내용을 담았다.\n \n실무에서 만나는 문제를 해결하면서 레벨업한다\n실무에서 공통으로 접하게 되는 분야를 문제로 출제했다. 문자열, 숫자, 배열, 컬렉션, 데이터 구조, 날짜와 시간, 불변성, 타입 추론, 옵셔널, 자바 I/O, 비동기 처리, 동시성, 자바 리플렉션, 람다, 스트림, 컬렉터, 함수형 프로그래밍, 디자인 패턴, HTTP Client API 등에 대한 문제를 수록했다. 문제마다 구글 검색으로 해결하려 한다면 코딩 속도가 너무 느리다. 으로 많은 문제를 접하고 해법을 익혀두자. 이미 접해본 문제와 해법이 많을수록 문제 해결력이 생기고 코딩 속도도 빨라진다.",
    pubdate: 20220930,
  },
  {
    title: "마음코딩 - 개정판 (컬러판) (개정판)",
    link: "https://search.shopping.naver.com/book/catalog/32462294659",
    image:
      "https://shopping-phinf.pstatic.net/main_3246229/32462294659.20220519170453.jpg",
    author: "하백",
    discount: 14500,
    publisher: "부크크(bookk)",
    isbn: 9791137264052,
    description:
      "기술과 예술은 절대 다른 영역처럼 보이지만 “움직임” 이라는 공통 분모를 가지고 있다. 움직임의 대상이 기계인지 사람인지가 다를 뿐 누구나 코딩을 한다. 그 대상이 기계를 향하든지 사람을 향하든지, 누구나 자신이 움직이고 싶은 대상이 있으며, 그 대상이 내 마음대로 움직였을 때 보람을 느끼며 행복할 수 있을 것이다.",
    pubdate: 20211130,
  },
  {
    title: "코딩 (하재일 시집 | 나뭇잎 한 장이 돌아왔다 내 영혼의 만타가오리!)",
    link: "https://search.shopping.naver.com/book/catalog/32466553667",
    image:
      "https://shopping-phinf.pstatic.net/main_3246655/32466553667.20220527044228.jpg",
    author: "하재일",
    discount: 8100,
    publisher: "천년의시작",
    isbn: 9788960213180,
    description:
      "1984년 월간  만해시인상으로 등단한 하재일 시인의 여섯 번째 시집 『코딩』. 오랜 시간 교단에 머물며 체득한 경험들을 시의 질료로 삼아 현실과 윤리 사이에서 충돌하는 내면의 이야기들을 때로는 위트로 때로는 구수하게 잘 풀어낸 시집이다. 그의 시는 간결하게 현실을 고발하면서도 현실 안에서 갈 곳 없어 떠도는 시인의 영혼을 자신만의 표현 방식으로 구현해내고 있다.",
    pubdate: 20170410,
  },
  {
    title:
      "혼자 공부하는 얄팍한 코딩 지식 (비전공자도 1:1 과외하듯 배우는 IT 지식 입문서)",
    link: "https://search.shopping.naver.com/book/catalog/32467089683",
    image:
      "https://shopping-phinf.pstatic.net/main_3246708/32467089683.20220527054308.jpg",
    author: "고현민",
    discount: 16200,
    publisher: "한빛미디어",
    isbn: 9791162245552,
    description:
      "- 혼자 해도 충분합니다! 1:1 과외하듯 배우는 IT 지식 입문서\n이 책은 독학으로 IT 지식을 배우는 입문자가 ‘꼭 필요한 내용을 제대로 학습’할 수 있도록 구성했습니다. 뭘 모르는지조차 모르는 입문자의 막연한 마음에 십분 공감하여 과외 선생님이 알려주듯 친절하게, 핵심 내용만 콕콕 집어 줍니다. 1장에서는 IT 업계 용어를 알아보며 개발과 개발자를 이해하고, 2장에서는 개발자가 실제로 사용하는 용어를 배우며 개발자와 소통할 수 있는 발판을 마련해 줍니다. 마지막 3장에서는 여러 가지 개발 용어를 바탕으로 개발자의 길로 들어설 수 있도록 친절하게 알려 줍니다. '개발이 뭔지 궁금했지만', '개발자와 소통해야 하지만', '개발자가 되고 싶지만' 기존 IT 지식서에서는 시원하게 알 수 없었던 진짜 코딩 지식을 〈혼공 얄코〉에서 만나 보세요! \n\n- 29명의 베타리더 검증으로, ‘함께 만든’ 입문자 맞춤형 도서\n29명의 베타리더와 함께 입문자에게 꼭 맞는 난이도, 분량, 학습 요소 등을 적극 반영했습니다. 어려운 용어와 개념은 한 번 더 풀어 쓰고, 적절한 예시와 비유로 누구나 이해할 수 있도록 구성했습니다. 또한 다양한 일러스트와 캐릭터로 재미있게 학습할 수 있도록 구성했습니다. ‘혼자 공부해 본’ 여러 입문자의 초심과 눈높이가 책 곳곳에 반영된 것이 이 책의 가장 큰 장점입니다.",
    pubdate: 20220525,
  },
  {
    title:
      "Do it! 조코딩의 프로그래밍 입문 (복붙으로 다 끝낸다! HTML부터 인공지능까지!)",
    link: "https://search.shopping.naver.com/book/catalog/33341333649",
    image:
      "https://shopping-phinf.pstatic.net/main_3334133/33341333649.20220712094400.jpg",
    author: "조동근^김형태",
    discount: 16200,
    publisher: "이지스퍼블리싱",
    isbn: 9791163033875,
    description:
      "IT 분야 영향력 1위 유튜버!\n42만 코린이가 열광한 조코딩!\nHTML부터 인공지능 서비스까지\n‘복붙’으로 다 끝내는 초고속 코딩 공부법!\n\n드디어 누구나 쉽게 배울 수 있는 조코딩식 코딩 공부법을 담은 책이 나왔다. IT 비전공자에다가 코딩 적성이 맞지 않아 고민하던 그가 앱 스토어 차트 2위의 〈동물상 테스트〉 앱을 만든 비결은 무엇일까? \n조코딩의 초고속 코딩 학습법은 지루한 문법 중심이 아니다. 조코딩은 뚜렷한 목표를 세우고 작은 실습부터 〈동물상 테스트〉까지 성취감을 주며 진도를 나가므로 더욱 특별하다. 그는 ‘코딩은 복잡한 논리를 설계하는 것이 아니라, 인터넷에서 필요한 코드를 찾아 복붙(Ctrl+C, Ctrl+V)하는 것’이라고 말한다. 그러면 비전공자도 입문자도 재밌게 코딩을 시작할 수 있고 원하는 서비스를 빠르게 완성할 수 있다. 이렇게 코딩을 한번 경험하고 나면 중학생이라도 전체 개발의 큰 그림을 그릴 수 있다. 또한 개발자들의 외계어를 다 알아들을 수 있을 뿐 아니라 조코딩처럼 결과물을 쉽고 빠르게 만드는 법도 터득할 수 있다.\n이 책은 HTML이나 자바스크립트로 구글 메인 화면을 똑같이 만들어 보거나 스타크래프트 게임 기능을 구현해 보면서 코딩의 기초를 배우고, 마지막에는 실제로 배포할 수 있는 〈동물상 테스트〉 만드는 과정을 실습한다. 책에 담긴 웹 서비스, 스마트폰 앱, 인공지능 앱 개발을 모두 실습하고 나면 IT 시대의 진정한 지식인이 된다. 코린이들이 공부하기 딱 좋은 시간은 지금이다. 왜냐고? 조코딩의 책이 나왔으니까!",
    pubdate: 20220718,
  },
];
